AlmAck/nuttx/arch/arm/src/da1470x/da1470x_serial.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_serial.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <debug.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>
#include <unistd.h>

#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/irq.h>
#include <nuttx/serial/serial.h>

#ifdef CONFIG_SERIAL_TERMIOS
#include <termios.h>
#endif

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "da1470x_clockconfig.h"
#include "da1470x_config.h"
#include "da1470x_irq.h"
#include "da1470x_lowputc.h"
#include "da1470x_serial.h"
#include "hardware/da1470x_uart.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* How many UARTs are supported */

#ifdef HAVE_UART2
#define DA1470X_NUART 3
#elif HAVE_UART1
#define DA1470X_NUART 2
#else
#define DA1470X_NUART 1
#endif

/* Some sanity checks *******************************************************/

/* Is there at least one UART enabled and configured as a RS-232 device? */

#ifndef HAVE_UART_DEVICE
#warning "No UARTs enabled"
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#if defined(HAVE_UART_DEVICE) && defined(USE_SERIALDRIVER)

/* Which UART with be tty0/console and which tty1-4?  The console will
 * always be ttyS0.  If there is no console then will use the lowest
 * numbered UART.
 */

#ifdef CONFIG_UART0_SERIAL_CONSOLE
#define CONSOLE_DEV g_uart0port /* UART0 is console */
#define TTYS0_DEV g_uart0port   /* UART0 is ttyS0 */
#elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#define CONSOLE_DEV g_uart1port /* UART1 is console */
#define TTYS0_DEV g_uart1port   /* UART1 is ttyS0 */
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure provides the state of one UART device */

struct da1470x_dev_s {
  uintptr_t uartbase; /* Base address of UART registers */
  uint8_t irq;        /* IRQ associated with this UART */
  bool rx_available;  /* rx byte available */

  /* UART configuration */

  struct uart_config_s config;
};

static int da1470x_setup(struct uart_dev_s *dev);
static void da1470x_shutdown(struct uart_dev_s *dev);
static int da1470x_attach(struct uart_dev_s *dev);
static void da1470x_detach(struct uart_dev_s *dev);
static int da1470x_interrupt(int irq, void *context, void *arg);
static int da1470x_ioctl(struct file *filep, int cmd, unsigned long arg);
static int da1470x_receive(struct uart_dev_s *dev, unsigned int *status);
static void da1470x_rxint(struct uart_dev_s *dev, bool enable);
static bool da1470x_rxavailable(struct uart_dev_s *dev);
static void da1470x_send(struct uart_dev_s *dev, int ch);
static void da1470x_txint(struct uart_dev_s *dev, bool enable);
static bool da1470x_txready(struct uart_dev_s *dev);
static bool da1470x_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_uart_ops = {
    .setup = da1470x_setup,
    .shutdown = da1470x_shutdown,
    .attach = da1470x_attach,
    .detach = da1470x_detach,
    .ioctl = da1470x_ioctl,
    .receive = da1470x_receive,
    .rxint = da1470x_rxint,
    .rxavailable = da1470x_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
    .rxflowcontrol = NULL,
#endif
    .send = da1470x_send,
    .txint = da1470x_txint,
    .txready = da1470x_txready,
    .txempty = da1470x_txempty,
};

/* I/O buffers */

#ifdef HAVE_UART0
static char g_uart0rxbuffer[CONFIG_UART0_RXBUFSIZE];
static char g_uart0txbuffer[CONFIG_UART0_TXBUFSIZE];
#endif
#ifdef HAVE_UART1
static char g_uart1rxbuffer[CONFIG_UART1_RXBUFSIZE];
static char g_uart1txbuffer[CONFIG_UART1_TXBUFSIZE];
#endif
#ifdef HAVE_UART2
static char g_uart2rxbuffer[CONFIG_UART2_RXBUFSIZE];
static char g_uart2txbuffer[CONFIG_UART2_TXBUFSIZE];
#endif

/* This describes the state of the DA1470X UART0 port. */

#ifdef HAVE_UART0
static struct da1470x_dev_s g_uart0priv = {.uartbase = DA1470X_UART0_BASE,
                                           .irq = DA1470X_IRQ_UART0,
                                           .rx_available = false,
                                           .config = {
                                               .baud = CONFIG_UART0_BAUD,
                                               .parity = CONFIG_UART0_PARITY,
                                               .bits = CONFIG_UART0_BITS,
                                               .stopbits2 = CONFIG_UART0_2STOP,
#ifdef CONFIG_UART0_IFLOWCONTROL
                                               .iflow = true,
#endif
#ifdef CONFIG_UART0_OFLOWCONTROL
                                               .oflow = true,
#endif
                                               .txpin = BOARD_UART0_TX_PIN,
                                               .rxpin = BOARD_UART0_RX_PIN,
                                           }};

