AlmAck/nuttx/arch/arm/src/da1470x/da1470x_serial.c
static uart_dev_t g_uart0port = {
    .recv =
        {
            .size = CONFIG_UART0_RXBUFSIZE,
            .buffer = g_uart0rxbuffer,
        },
    .xmit =
        {
            .size = CONFIG_UART0_TXBUFSIZE,
            .buffer = g_uart0txbuffer,
        },
    .ops = &g_uart_ops,
    .priv = &g_uart0priv,
};
#endif

/* This describes the state of the DA1470X UART1 port. */

#ifdef HAVE_UART1
static struct da1470x_dev_s g_uart1priv = {.uartbase = DA1470X_UART1_BASE,
                                           .irq = DA1470X_IRQ_UART1,
                                           .rx_available = false,
                                           .config = {
                                               .baud = CONFIG_UART1_BAUD,
                                               .parity = CONFIG_UART1_PARITY,
                                               .bits = CONFIG_UART1_BITS,
                                               .stopbits2 = CONFIG_UART1_2STOP,
#ifdef CONFIG_UART1_IFLOWCONTROL
                                               .iflow = true,
#endif
#ifdef CONFIG_UART1_OFLOWCONTROL
                                               .oflow = true,
#endif
                                               .txpin = BOARD_UART1_TX_PIN,
                                               .rxpin = BOARD_UART1_RX_PIN,
                                           }};

static uart_dev_t g_uart1port = {
    .recv =
        {
            .size = CONFIG_UART1_RXBUFSIZE,
            .buffer = g_uart1rxbuffer,
        },
    .xmit =
        {
            .size = CONFIG_UART1_TXBUFSIZE,
            .buffer = g_uart1txbuffer,
        },
    .ops = &g_uart_ops,
    .priv = &g_uart1priv,
};
#endif

/* This describes the state of the DA1470X UART2 port. */

#ifdef HAVE_UART2
static struct da1470x_dev_s g_uart2priv = {.uartbase = DA1470X_UART2_BASE,
                                           .irq = DA1470X_IRQ_UART2,
                                           .rx_available = false,
                                           .config = {
                                               .baud = CONFIG_UART2_BAUD,
                                               .parity = CONFIG_UART2_PARITY,
                                               .bits = CONFIG_UART2_BITS,
                                               .stopbits2 = CONFIG_UART2_2STOP,
#ifdef CONFIG_UART2_IFLOWCONTROL
                                               .iflow = true,
#endif
#ifdef CONFIG_UART2_OFLOWCONTROL
                                               .oflow = true,
#endif
                                               .txpin = BOARD_UART2_TX_PIN,
                                               .rxpin = BOARD_UART2_RX_PIN,
                                           }};

static uart_dev_t g_uart2port = {
    .recv =
        {
            .size = CONFIG_UART2_RXBUFSIZE,
            .buffer = g_uart2rxbuffer,
        },
    .xmit =
        {
            .size = CONFIG_UART2_TXBUFSIZE,
            .buffer = g_uart2txbuffer,
        },
    .ops = &g_uart_ops,
    .priv = &g_uart2priv,
};
#endif

/* This table lets us iterate over the configured UARTs */

static struct uart_dev_s *const g_uart_devs[DA1470X_NUART] = {
#ifdef HAVE_UART0
    [0] = &g_uart0port,
#endif
#ifdef HAVE_UART1
    [1] = &g_uart1port
#endif
#ifdef HAVE_UART2
              [2] = &g_uart2port
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int da1470x_setup(struct uart_dev_s *dev) {
#ifndef CONFIG_SUPPRESS_UART_CONFIG
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* The console UART was already brought up by da1470x_lowsetup() before
   * any kernel code ran. Reconfiguring it here is unsafe: the DesignWare
   * UART silently ignores LCR writes (including the DLAB latch) while
   * USR.BUSY is asserted, which causes divisor writes to be redirected
   * into THR and breaks the baud rate. da1470x_uart_configure() now does
   * a software reset, but for the console we still skip the redundant
   * reconfigure to avoid any race against in-flight TX from boot output.
   */

  if (!dev->isconsole) {
    da1470x_uart_configure(priv->uartbase, &priv->config);
  }
#endif

  return OK;
}

/****************************************************************************
 * Name: da1470x_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void da1470x_shutdown(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* Disable interrupts */

  /* Reset hardware and disable Rx and Tx */

  da1470x_uart_disable(priv->uartbase, &priv->config);
}

/****************************************************************************
 * Name: da1470x_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the the setup() method is called, however, the serial console may
 *   operate in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).
 *   The RX and TX interrupts are not enabled until the txint() and rxint()
 *   methods are called.
 *
 ****************************************************************************/

static int da1470x_attach(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ(s). */

  ret = irq_attach(priv->irq, da1470x_interrupt, dev);
  if (ret == OK) {
    up_enable_irq(priv->irq);
  }

  return ret;
}

/****************************************************************************
 * Name: da1470x_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.
 *   The exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

