AlmAck/nuttx/arch/arm/src/da1470x/da1470x_serial.c
static void da1470x_detach(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* Disable interrupts */

  putreg32(0, priv->uartbase + DA1470_UART_IER_DLH_OFFSET);
  up_disable_irq(priv->irq);

  /* Detach from the interrupt(s) */

  irq_detach(priv->irq);
}

static int da1470x_interrupt(int irq, void *context, void *arg) {
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct da1470x_dev_s *priv;
  uint32_t iir;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  priv = (struct da1470x_dev_s *)dev->priv;

  /* Loop while there is an interrupt pending.
   * Note: Busy Detect (ID 7) has bit 0 set to 1, so we check for both.
   */

  while (((iir = getreg32(priv->uartbase + DA1470_UART_IIR_FCR_OFFSET)) &
          UART_IIR_NO_INT) == 0 ||
         (iir & UART_IIR_ID_MASK) == 7) {
    switch (iir & UART_IIR_ID_MASK) {
    case UART_IIR_ID_RLS:
      /* Receiver Line Status: clear by reading LSR */

      getreg32(priv->uartbase + DA1470_UART_LSR_OFFSET);
      break;

    case UART_IIR_ID_RDA:
    case UART_IIR_ID_CTI:
      /* Received Data Available or Character Timeout: call uart_recvchars */

      priv->rx_available = true;
      uart_recvchars(dev);
      break;

    case UART_IIR_ID_THRE:
      /* Transmitter Holding Register Empty: call uart_xmitchars */

      uart_xmitchars(dev);
      break;

    case UART_IIR_ID_BUSY:
      /* Busy Detect: clear by reading USR */

      getreg32(priv->uartbase + DA1470_UART_USR_OFFSET);
      break;

    case 0:
      /* Modem Status: clear by reading MSR (offset 0x18) */

      getreg32(priv->uartbase + 0x18);
      break;

    default:
      /* Unhandled or unknown interrupt: clear what we can and exit
       * to avoid infinite loop in ISR.
       */

      return OK;
    }
  }

  return OK;
}

/****************************************************************************
 * Name: da1470x_set_format
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TERMIOS
void da1470x_set_format(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  da1470x_usart_setformat(priv->uartbase, &priv->config);
}
#endif

/****************************************************************************
 * Name: da1470x_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int da1470x_ioctl(struct file *filep, int cmd, unsigned long arg) {
#ifdef CONFIG_SERIAL_TERMIOS
  struct inode *inode = filep->f_inode;
  struct uart_dev_s *dev = inode->i_private;
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;
  struct uart_config_s *config = &priv->config;
#endif
  int ret = OK;

  switch (cmd) {
#ifdef CONFIG_SERIAL_TERMIOS
  case TCGETS: {
    struct termios *termiosp = (struct termios *)arg;

    if (!termiosp) {
      ret = -EINVAL;
      break;
    }

    termiosp->c_cflag = ((config->parity != 0) ? PARENB : 0) |
                        ((config->parity == 1) ? PARODD : 0) |
                        ((config->stopbits2) ? CSTOPB : 0) |
#ifdef CONFIG_SERIAL_OFLOWCONTROL
                        ((config->oflow) ? CCTS_OFLOW : 0) |
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
                        ((config->iflow) ? CRTS_IFLOW : 0) |
#endif
                        CS8;

    cfsetispeed(termiosp, config->baud);

    break;
  }

  case TCSETS: {
    struct termios *termiosp = (struct termios *)arg;

    if (!termiosp) {
      ret = -EINVAL;
      break;
    }

    /* Perform some sanity checks before accepting any changes */

    if ((termiosp->c_cflag & CSIZE) != CS8) {
      ret = -EINVAL;
      break;
    }

#ifndef HAVE_UART_STOPBITS
    if ((termiosp->c_cflag & CSTOPB) != 0) {
      ret = -EINVAL;
      break;
    }
#endif

    if (termiosp->c_cflag & PARODD) {
      ret = -EINVAL;
      break;
    }

    /* TODO: CCTS_OFLOW and CRTS_IFLOW */

    /* Parity */

    if (termiosp->c_cflag & PARENB) {
      config->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
    } else {
      config->parity = 0;
    }

#ifdef HAVE_UART_STOPBITS
    /* Stop bits */

    config->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;
#endif

    /* Note that only cfgetispeed is used because we have knowledge
     * that only one speed is supported.
     */

    config->baud = cfgetispeed(termiosp);

    /* Effect the changes */

    da1470x_set_format(dev);

    break;
  }
#endif

  default: {
    ret = -ENOTTY;
    break;
  }
  }

  return ret;
}

/****************************************************************************
 * Name: da1470x_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the UART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

static int da1470x_receive(struct uart_dev_s *dev, unsigned int *status) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;
  uint32_t data;

  /* Get input data along with receiver control information */

  data = getreg32(priv->uartbase + DA1470_UART_RBR_THR_DLL_OFFSET);
  priv->rx_available = false;

  /* Return receiver control information */

  if (status) {
    *status = 0x00;
  }

  /* Then return the actual received data. */

  return data;
}

/****************************************************************************
 * Name: da1470x_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

static void da1470x_rxint(struct uart_dev_s *dev, bool enable) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;
  uint32_t ier;

  ier = getreg32(priv->uartbase + DA1470_UART_IER_DLH_OFFSET);

  if (enable) {
    ier |= UART_IER_ERBFI;
  } else {
    ier &= ~UART_IER_ERBFI;
  }

  putreg32(ier, priv->uartbase + DA1470_UART_IER_DLH_OFFSET);

  //   if (enable)
  //     {
  // #ifndef CONFIG_SUPPRESS_SERIAL_INTS
  //       /* Receive an interrupt when their is anything in the Rx data
  //       register
  //        * (or an Rx timeout occurs).
  //        */

  //       putreg32(UART_INT_RXDRDY, priv->uartbase +
  //       DA1470X_UART_INTENSET_OFFSET); putreg32(1, priv->uartbase +
  //       DA1470X_UART_TASKS_STARTRX_OFFSET);

