AlmAck/nuttx/arch/arm/src/da1470x/da1470x_serial.c
  // #endif
  //     }
  //   else
  //     {
  //       putreg32(UART_INT_RXDRDY, priv->uartbase +
  //       DA1470X_UART_INTENCLR_OFFSET); putreg32(1, priv->uartbase +
  //       DA1470X_UART_TASKS_STOPRX_OFFSET);
  //     }
}

/****************************************************************************
 * Name: da1470x_rxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

static bool da1470x_rxavailable(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* Return true if the receive buffer/fifo is not "empty." */

  return priv->rx_available;
}

/****************************************************************************
 * Name: da1470x_send
 *
 * Description:
 *   This method will send one byte on the UART.
 *
 ****************************************************************************/

static void da1470x_send(struct uart_dev_s *dev, int ch) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  // Wait if Transmit Holding Register is full

  putreg32(ch, priv->uartbase + DA1470_UART_RBR_THR_DLL_OFFSET);
  // while (getreg32(priv->uartbase + DA1470X_UART_EVENTS_TXDRDY_OFFSET) == 0)
  //   {
  //   }
}

/****************************************************************************
 * Name: da1470x_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void da1470x_txint(struct uart_dev_s *dev, bool enable) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  irqstate_t flags = enter_critical_section();

  /* Read the current value of the IER_DLH register */

  uint16_t ier_dlh_reg = getreg32(priv->uartbase + DA1470_UART_IER_DLH_OFFSET);

  /* Modify the required fields */

  if (enable) {
    /* Enable the TX interrupt. Do NOT set PTIME (Programmable THRE
     * Interrupt Mode): with PTIME=1 the THRE interrupt re-asserts the
     * moment the FIFO drains below threshold and stays asserted while
     * empty, generating an IRQ storm whenever xmit.buffer is empty
     * because the IIR's THRE indication only clears by writing data --
     * not by reading IIR. Plain ETBEI fires once when THR transitions
     * to empty, which is what NuttX's uart_xmitchars expects.
     */

    ier_dlh_reg |= UART_IER_ETBEI;
  } else {
    ier_dlh_reg &= ~(UART_IER_ETBEI | UART_IER_PTIME);
  }

  /* Write the updated value back to the register */

  putreg32(ier_dlh_reg, priv->uartbase + DA1470_UART_IER_DLH_OFFSET);

  leave_critical_section(flags);

  if (enable) {
    /* Fake a TX interrupt here by just calling uart_xmitchars() with
     * interrupts disabled (note this may recurse).
     */

    uart_xmitchars(dev);
  }
}

/****************************************************************************
 * Name: da1470x_txready
 *
 * Description:
 *   Return true if the tranmsit data register is empty
 *
 ****************************************************************************/

static bool da1470x_txready(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* Return true if the transmit FIFO is "not full." */

  return (getreg32(priv->uartbase + DA1470_UART_USR_OFFSET) & UART_USR_TFNF) !=
         0;
}

/****************************************************************************
 * Name: da1470x_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool da1470x_txempty(struct uart_dev_s *dev) {
  struct da1470x_dev_s *priv = (struct da1470x_dev_s *)dev->priv;

  /* Return true if the transmit FIFO is "empty." */

  return (getreg32(priv->uartbase + DA1470_UART_USR_OFFSET) & UART_USR_TFE) !=
         0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_earlyserialinit
 *
 * Description:
 *   Performs the low level UART initialization early in debug so that the
 *   serial console will be available during bootup.  This must be called
 *   before da1470x_serialinit.  NOTE:  This function depends on GPIO pin
 *   configuration performed in da1470x_lowsetup() and main clock
 *   initialization performed in da1470_clock_configure().
 *
 ****************************************************************************/

#ifdef USE_EARLYSERIALINIT
void da1470x_earlyserialinit(void) {
  /* Configuration whichever one is the console */

#ifdef HAVE_UART_CONSOLE
  CONSOLE_DEV.isconsole = true;
  // da1470x_setup(&CONSOLE_DEV);
#endif
}
#endif

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that da1470x_earlyserialinit was called previously.
 *
 * Input Parameters:
 *   None
 *
 * Returns Value:
 *   None
 *
 ****************************************************************************/

void arm_serialinit(void) {
  unsigned minor = 0;
  unsigned i = 0;
  char devname[16];

#ifdef HAVE_UART_CONSOLE
  /* Register the serial console */

  uart_register("/dev/console", &CONSOLE_DEV);
  uart_register("/dev/ttyS0", &TTYS0_DEV);
  minor = 1;
#endif

  /* Register all remaining UARTs */

  strlcpy(devname, "/dev/ttySx", sizeof(devname));

  for (i = 0; i < DA1470X_NUART; i++) {
    /* Don't create a device for non-configured ports. */

    if (g_uart_devs[i] == NULL) {
      continue;
    }

    /* Don't create a device for the console - we did that above */

    if (g_uart_devs[i]->isconsole) {
      continue;
    }

    /* Register USARTs as devices in increasing order */

    devname[9] = '0' + minor++;
    uart_register(devname, g_uart_devs[i]);
  }
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug  writes
 *
 ****************************************************************************/

void up_putc(int ch) {
#ifdef HAVE_UART_CONSOLE
  /* struct da1470x_dev_s *priv = (struct da1470x_dev_s *)CONSOLE_DEV.priv; */

  /* Check for LF */

  if (ch == '\n') {
    /* Add CR */

    arm_lowputc('\r');
  }

  arm_lowputc(ch);
#endif
}

#else /* USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

void up_putc(int ch) {
#ifdef HAVE_UART_CONSOLE
  /* Check for LF */

  if (ch == '\n') {
    /* Add CR */

    arm_lowputc('\r');
  }

  arm_lowputc(ch);
#endif
}

#endif /* HAVE_UART_DEVICE && USE_SERIALDRIVER */
